RSN/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>СерверПриложений</name>
    <type>
      <types>CatalogRef.СерверПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьНаВебСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>EnumRef.КонфигурацииИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Среда</name>
    <type>
      <types>EnumRef.Среда</types>
    </type>
  </attributes>
  <attributes>
    <name>Контур</name>
    <type>
      <types>CatalogRef.Контур</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Enums/КонфигурацииИнформационныхБаз/КонфигурацииИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонфигурацииИнформационныхБаз</name>
  <enumValues>
    <name>Бухгалтерия</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Документооборот</name>
  </enumValues>
  <enumValues>
    <name>УправлениеХолдингом</name>
  </enumValues>
  <enumValues>
    <name>БухгалтерияБИТ</name>
  </enumValues>
  <enumValues>
    <name>ГорнодобывающаяПромышленность</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Enums/Среда/Среда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Среда</name>
  <enumValues>
    <name>Prod</name>
  </enumValues>
  <enumValues>
    <name>Test</name>
  </enumValues>
  <enumValues>
    <name>Dev</name>
  </enumValues>
  <enumValues>
    <name>Stage</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Catalogs/СерверПриложений/СерверПриложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерверПриложений</name>
  <attributes>
    <name>IP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IPBD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контур</name>
    <type>
      <types>CatalogRef.Контур</types>
    </type>
  </attributes>
  <attributes>
    <name>Среда</name>
    <type>
      <types>EnumRef.Среда</types>
    </type>
  </attributes>
  <attributes>
    <name>МониторингБаз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверЛицензирования</name>
    <type>
      <types>CatalogRef.СерверПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>МониторингБазДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Catalogs/ВидыМетаданных/ВидыМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыМетаданных</name>
  <predefined>
    <items>
      <name>Документы</name>
      <description>Документы</description>
    </items>
    <items>
      <name>ЖурналыДокументов</name>
      <description>Журналы документов</description>
    </items>
    <items>
      <name>Обработки</name>
      <description>Обработки</description>
    </items>
    <items>
      <name>Отчеты</name>
      <description>Отчеты</description>
    </items>
    <items>
      <name>ПланыВидовХарактеристик</name>
      <description>Планы видов характеристик</description>
    </items>
    <items>
      <name>РегистрыБухгалтерии</name>
      <description>Регистры бухгалтерии</description>
    </items>
    <items>
      <name>РегистрыНакопления</name>
      <description>Регистры накопления</description>
    </items>
    <items>
      <name>РегистрыРасчета</name>
      <description>Регистры расчета</description>
    </items>
    <items>
      <name>РегистрыСведений</name>
      <description>Регистры сведений</description>
    </items>
    <items>
      <name>Справочники</name>
      <description>Справочники</description>
    </items>
  </predefined>
</mdclass:Catalog>

RSN/src/Catalogs/ОбъектыМетаданныхИнформационныхБаз/ОбъектыМетаданныхИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыМетаданныхИнформационныхБаз</name>
  <owners>Catalog.ВидыМетаданных</owners>
  <attributes>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВСервисе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИменаРеквизитовТипаДата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПриЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Catalogs/ИнформационныеБазы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда    
	
#Область ПрограммныйИнтерфейс   

Процедура ОбновитьСписокИнформационныхБаз() Экспорт     
	
	БазыСерверов = Новый ТаблицаЗначений; 
	БазыСерверов.Колонки.Добавить("ИмяБазы", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));    
	БазыСерверов.Колонки.Добавить("СерверПриложений", Новый ОписаниеТипов("СправочникСсылка.СерверПриложений"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерверПриложений.Ссылка КАК СерверПриложений,
		|	СерверПриложений.Наименование КАК СерверПриложенийНаименование
		|ИЗ
		|	Справочник.СерверПриложений КАК СерверПриложений
		|ГДЕ
		|	НЕ СерверПриложений.ПометкаУдаления
		|	И СерверПриложений.МониторингБаз";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		БазыСервера = ПолучитьСписокБазСервера(Выборка.СерверПриложенийНаименование);	
		Для Каждого База Из БазыСервера Цикл 	
			ЗаполнитьЗначенияСвойств(БазыСерверов.Добавить(), Новый Структура("ИмяБазы, СерверПриложений", База, Выборка.СерверПриложений));				
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БазыСерверов.ИмяБазы КАК ИмяБазы,
		|	БазыСерверов.СерверПриложений КАК СерверПриложений
		|ПОМЕСТИТЬ ВТ_БазыСерверов
		|ИЗ
		|	&БазыСерверов КАК БазыСерверов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_БазыСерверов.ИмяБазы КАК ИмяБазы,
		|	ВТ_БазыСерверов.СерверПриложений КАК СерверПриложений,
		|	ВТ_БазыСерверов.СерверПриложений.Контур КАК Контур,
		|	ВТ_БазыСерверов.СерверПриложений.Среда КАК Среда,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_БазыСерверов.СерверПриложений) КАК СерверПриложенийПредставление,
		|	ИнформационныеБазы.Ссылка КАК ИнформационнаяБаза
		|ИЗ
		|	ВТ_БазыСерверов КАК ВТ_БазыСерверов
		|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ИнформационныеБазы КАК ИнформационныеБазы
		|		ПО ВТ_БазыСерверов.ИмяБазы = ИнформационныеБазы.Наименование
		|			И ВТ_БазыСерверов.СерверПриложений = ИнформационныеБазы.СерверПриложений
		|ГДЕ
		|	(ВТ_БазыСерверов.ИмяБазы ЕСТЬ NULL
		|				И НЕ ИнформационныеБазы.ПометкаУдаления
		|			ИЛИ ИнформационныеБазы.Ссылка ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("БазыСерверов", БазыСерверов);    
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ИмяБазы) Тогда
			ДобавитьБазу(Выборка.ИмяБазы, Выборка.СерверПриложений, Выборка.Контур, Выборка.Среда, Выборка.СерверПриложенийПредставление, Ложь);	
		ИначеЕсли ЗначениеЗаполнено(Выборка.ИнформационнаяБаза) Тогда
			ИнформационнаяБаза = Выборка.ИнформационнаяБаза.ПолучитьОбъект();
			ИнформационнаяБаза.УстановитьПометкуУдаления(Истина);
		КонецЕсли;                                                                                              		
				
	КонецЦикла;
	
КонецПроцедуры  

Функция ПолучитьСписокБазСервера(ИмяСервераПриложений) Экспорт
	
	Результат = Новый Массив; 
	
	Соединитель = Новый COMObject("V83.COMConnector"); 
	
	Порт = "1540"; 
	СтрокаСоединения = "TCP://" + ИмяСервераПриложений + ":" + Порт;
	
	СоединениеСАгентом = Соединитель.ConnectAgent(СтрокаСоединения);
	МассивКластеров = СоединениеСАгентом.GetClusters();
	
	// получается первый массив кластера.
	ОписаниеКластера = МассивКластеров.GetValue(МассивКластеров.GetLowerBound());
	
	// в случае если определены администраторы кластера, должны быть указаны данные о логине.
	СоединениеСАгентом.authenticate(ОписаниеКластера, "", "");    
	
	МассивБаз = СоединениеСАгентом.GetInfoBases(ОписаниеКластера);
	МаксимальныйИндекс = МассивБаз.GetUpperBound();
	
	Для ТекущийИндекс = МассивБаз.GetLowerBound() По МаксимальныйИндекс Цикл
		ОписаниеБазы = МассивБаз.GetValue(ТекущийИндекс); 
				
		Результат.Добавить(ОписаниеБазы.Name);		
			
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьБазыВСписок(СерверПриложений, ИменаБаз) Экспорт
	
	Если Не ЗначениеЗаполнено(СерверПриложений) ИЛИ ИменаБаз.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаИменБаз = Новый ТаблицаЗначений; 
	ТаблицаИменБаз.Колонки.Добавить("ИмяБазы", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));    
	ТаблицаИменБаз.Колонки.Добавить("СерверПриложений", Новый ОписаниеТипов("СправочникСсылка.СерверПриложений"));
	
	Для Каждого Стр Из ИменаБаз Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаИменБаз.Добавить(), Новый Структура("ИмяБазы, СерверПриложений", Стр, СерверПриложений));	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИменаБаз.ИмяБазы КАК ИмяБазы,
		|	ИменаБаз.СерверПриложений КАК СерверПриложений
		|ПОМЕСТИТЬ ВТ_ИменаБаз
		|ИЗ
		|	&ТаблицаИменБаз КАК ИменаБаз
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИменаБаз.ИмяБазы КАК ИмяБазы,
		|	ВТ_ИменаБаз.СерверПриложений КАК СерверПриложений, 
		|	ВТ_ИменаБаз.СерверПриложений.Контур КАК Контур,
		|	ВТ_ИменаБаз.СерверПриложений.Среда КАК Среда,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_ИменаБаз.СерверПриложений) КАК СерверПриложенийПредставление
		|ИЗ
		|	ВТ_ИменаБаз КАК ВТ_ИменаБаз
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнформационныеБазы КАК ИнформационныеБазы
		|		ПО ВТ_ИменаБаз.ИмяБазы = ИнформационныеБазы.Наименование
		|			И ВТ_ИменаБаз.СерверПриложений = ИнформационныеБазы.СерверПриложений
		|ГДЕ
		|	ИнформационныеБазы.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТаблицаИменБаз", ТаблицаИменБаз);
		
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Пока Выборка.Следующий() Цикл  
		ДобавитьБазу(Выборка.ИмяБазы, Выборка.СерверПриложений, Выборка.Контур, Выборка.Среда, Выборка.СерверПриложенийПредставление);		
	КонецЦикла; 		

КонецПроцедуры

Процедура ЗарегистрироватьОсновныеОбъекты(СписокБаз, НастройкиАвторизации = Неопределено, ЕстьОшибки, СоответсвиеПодключений = Неопределено) Экспорт  
	
	ДобавитьРегистрациюОбъектовМетаданных();   
	
	Если НастройкиАвторизации = Неопределено Тогда	
		
		Настройки = Новый Структура("Логин,Пароль"); 
		Настройки.Логин = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("CDM_USER", "Логин");
		Настройки.Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("CDM_USER", "Пароль");
		Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", Настройки.Логин, Настройки.Пароль)); 
		
	Иначе
		
		Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", НастройкиАвторизации.ИмяПользователя, НастройкиАвторизации.Пароль));
		
	КонецЕсли;
	
	АутентификацияПоУмолчанию = Аутентификация;
	
	Для Каждого Стр Из СписокБаз Цикл  
		
		Если Не ЗначениеЗаполнено(Стр.ПутьНаВебСервере) Тогда
			Продолжить;
		КонецЕсли;
		
		//ins+
		Если СоответсвиеПодключений = Неопределено = Ложь Тогда 
			Конфигурация 	= Стр.Конфигурация;//ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Иб, "Конфигурация");
			Аутентификация 	= Интеграция.ПолучитьАвторизациюИзСоответствия(СоответсвиеПодключений, Конфигурация, АутентификацияПоУмолчанию);	
		КонецЕсли;
		//ins-
		Попытка
			
			Если Не Интеграция.ПроверитьДоступностьВебСервиса(Стр.ПутьНаВебСервере, Аутентификация) Тогда
				Продолжить;
			КонецЕсли;  		
			
			ПараметрыРегистрации = Интеграция.НовыйПараметрыРегистрацииОбъектаМетаданных(); 
			ЗаполнитьЗначенияСвойств(ПараметрыРегистрации, Новый Структура("fullname,parent,name", 
										"Справочник.ПрофилиГруппДоступа", "Catalogs", "AccessGroupProfiles"));	
			Интеграция.ЗарегистрироватьОбъектМетаданных(Стр.ПутьНаВебСервере, Аутентификация, ПараметрыРегистрации);
			
			ПараметрыРегистрации = Интеграция.НовыйПараметрыРегистрацииОбъектаМетаданных(); 
			ЗаполнитьЗначенияСвойств(ПараметрыРегистрации, Новый Структура("fullname,parent,name", 
										"Справочник.ГруппыДоступа", "Catalogs", "AccessGroups"));	
			Интеграция.ЗарегистрироватьОбъектМетаданных(Стр.ПутьНаВебСервере, Аутентификация, ПараметрыРегистрации);
			
			
			ПараметрыРегистрации = Интеграция.НовыйПараметрыРегистрацииОбъектаМетаданных();
			ПараметрыРегистрации.fullname = "Справочник.Пользователи";
			ПараметрыРегистрации.parent = "Catalogs";
			ПараметрыРегистрации.name = "Users"; 
			ПараметрыРегистрации.searchkey = "Наименование";
			Интеграция.ЗаполнитьТекстыДопОбработчиков(ПараметрыРегистрации, Стр.Конфигурация, "Справочник.Пользователи");		
			Интеграция.ЗарегистрироватьОбъектМетаданных(Стр.ПутьНаВебСервере, Аутентификация, ПараметрыРегистрации);
			
			
			ПараметрыРегистрации = Интеграция.НовыйПараметрыРегистрацииОбъектаМетаданных(); 
			ЗаполнитьЗначенияСвойств(ПараметрыРегистрации, Новый Структура("fullname,parent,name", 
										"Обработка.АктивныеПользователи", "DataProcessings", "UserAccessGroups"));
			Интеграция.ЗаполнитьТекстыДопОбработчиков(ПараметрыРегистрации, Стр.Конфигурация, "Обработка.АктивныеПользователи");		
			Интеграция.ЗарегистрироватьОбъектМетаданных(Стр.ПутьНаВебСервере, Аутентификация, ПараметрыРегистрации); 
			
			
			ПараметрыРегистрации = Интеграция.НовыйПараметрыРегистрацииОбъектаМетаданных(); 
			ЗаполнитьЗначенияСвойств(ПараметрыРегистрации, Новый Структура("fullname,parent,name", 
										"Обработка.АктивныеПользователи", "DataProcessings", "UserAccessGroupsSettings"));
			ПараметрыРегистрации.Вставить("request", "Результат = Новый Структура(""ПоискПоПрофилю"",  УправлениеДоступомСлужебный.УпрощенныйИнтерфейсНастройкиПравДоступа());");
			Интеграция.ЗарегистрироватьОбъектМетаданных(Стр.ПутьНаВебСервере, Аутентификация, ПараметрыРегистрации);
			
			ПараметрыРегистрации = Интеграция.НовыйПараметрыРегистрацииОбъектаМетаданных();
			ПараметрыРегистрации.fullname = "Справочник.ДополнительныеОтчетыИОбработки";
			ПараметрыРегистрации.parent = "Catalogs";
			ПараметрыРегистрации.name = "AdditionalReporting"; 
			ПараметрыРегистрации.searchkey = "ИмяОбъекта";
			Интеграция.ЗаполнитьТекстыДопОбработчиков(ПараметрыРегистрации, Стр.Конфигурация, "Справочник.ДополнительныеОтчетыИОбработки");		
			Интеграция.ЗарегистрироватьОбъектМетаданных(Стр.ПутьНаВебСервере, Аутентификация, ПараметрыРегистрации); 
			
			ПараметрыРегистрации = Интеграция.ПараметрыРегистрацииИзБазы(Справочники.ВидыМетаданных.РегистрыСведений, "RulesForDataExchange"); 
			Интеграция.ЗарегистрироватьОбъектМетаданных(Стр.ПутьНаВебСервере, Аутентификация, ПараметрыРегистрации); 		
			     		
		Исключение  
			ЕстьОшибки = Истина;
			ОбщегоНазначения.СообщитьПользователю("Ошибка при подключении по адресу " + Стр.ПутьНаВебСервере + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		КонецПопытки;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ДобавитьБазу(Наименование, СерверПриложений, Контур, Среда, СерверПриложенийПредставление, УказыватьПутьНаВебСервере = Истина)
	          
	НоваяБаза = Справочники.ИнформационныеБазы.СоздатьЭлемент();
	НоваяБаза.Наименование = Наименование;   
	НоваяБаза.СерверПриложений = СерверПриложений; 
	НоваяБаза.Контур = Контур;
	НоваяБаза.Среда = Среда;
	
	Если ВРег(Лев(Наименование,6)) = "ACC_BX" Тогда
		НоваяБаза.Конфигурация = Перечисления.КонфигурацииИнформационныхБаз.БухгалтерияБИТ;
	ИначеЕсли ВРег(Лев(Наименование,3)) = "ACC" Тогда
		НоваяБаза.Конфигурация = Перечисления.КонфигурацииИнформационныхБаз.Бухгалтерия;
	ИначеЕсли ВРег(Лев(Наименование,3)) = "HRM" Тогда                                                         
		НоваяБаза.Конфигурация = Перечисления.КонфигурацииИнформационныхБаз.Зарплата;
	ИначеЕсли ВРег(Лев(Наименование,6)) = "DOCMNG" Тогда                                                         
		НоваяБаза.Конфигурация = Перечисления.КонфигурацииИнформационныхБаз.Документооборот;
	ИначеЕсли ВРег(Лев(Наименование,2)) = "UH" Тогда                                                         
		НоваяБаза.Конфигурация = Перечисления.КонфигурацииИнформационныхБаз.УправлениеХолдингом;
	КонецЕсли;
	
	НоваяБаза.Тестовая = (Не Среда = Перечисления.Среда.Prod);
	
	Если УказыватьПутьНаВебСервере Тогда
		НоваяБаза.ПутьНаВебСервере = СерверПриложенийПредставление + "/" + Наименование;
	КонецЕсли;
		
	НоваяБаза.Записать();
	
	Возврат НоваяБаза.Ссылка; 	
	
КонецФункции

&НаСервере
Процедура ДобавитьРегистрациюОбъектовМетаданных() 
	
	ДобавитьРегистрациюОбъектаМетаданных("ПрофилиГруппДоступа", "AccessGroupProfiles");
	ДобавитьРегистрациюОбъектаМетаданных("ГруппыДоступа", "AccessGroups");
	ДобавитьРегистрациюОбъектаМетаданных("Пользователи", "Users");
	ДобавитьРегистрациюОбъектаМетаданных("um_ОбъектыМетаданных", "um_MetadataObjects");
	ДобавитьРегистрациюОбъектаМетаданных("ДополнительныеОтчетыИОбработки", "AdditionalReporting");
		
КонецПроцедуры 

&НаСервере
Процедура ДобавитьРегистрациюОбъектаМетаданных(ИмяОбъекта, ПредставлениеОбъекта)
	
	НайденныйЭлемент = Справочники.ОбъектыМетаданныхИнформационныхБаз.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбъекта); 
	Если Не НайденныйЭлемент.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	НовыйОбъект = Справочники.ОбъектыМетаданныхИнформационныхБаз.СоздатьЭлемент();
	НовыйОбъект.Владелец = Справочники.ВидыМетаданных.Справочники;
	НовыйОбъект.Наименование = ИмяОбъекта;
	НовыйОбъект.ИмяОбъекта = ИмяОбъекта; 
	НовыйОбъект.ПредставлениеВСервисе = ПредставлениеОбъекта; 
	НовыйОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
